In [2]:
import pandas as pd

course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']

duration =  [2,3,6,4]

df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [3]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

Q1. Write a code to print the data present in the second row of the dataframe, df.

In [4]:
df.iloc[1:2,[0,1]]

        course_name  duration
1  Machine Learning         3

Q2. What is the difference between the functions loc and iloc in pandas.DataFrame

ANS:The difference between the functions loc and iloc in pandas DataFrame
is that the loc function takes column name with the values present 
in the rows and iloc just takes values and return dataframe.

Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df 
then find the output for both new_df.loc[2] and new_df.iloc[2].
Did you observe any difference in both the outputs? If so then explain it

In [5]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [6]:
new_df=df.reindex([3,0,1,2])

In [7]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [8]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [9]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

we observe that both are returning the different values

In [10]:
import pandas as pd

import numpy as np

columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']

indices = [1,2,3,4,5,6]

#Creating a dataframe:

df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [11]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.945916  0.147849  0.827100  0.989795  0.306548  0.516464
2  0.132754  0.240911  0.612191  0.716993  0.784992  0.229394
3  0.265798  0.336899  0.898173  0.775464  0.609711  0.072037
4  0.032749  0.362606  0.200667  0.331942  0.668250  0.125248
5  0.450534  0.505613  0.422768  0.556811  0.087988  0.901227
6  0.567016  0.194573  0.751008  0.952512  0.979954  0.872463

Q4. Write a code to find the following statistical measurements for the above dataframe df1:

(i) 	mean of each and every column present in the dataframe.

(ii) standard deviation of column, ‘column_2'.

In [12]:
df1.mean()

column_1    0.399128
column_2    0.298075
column_3    0.618651
column_4    0.720586
column_5    0.572907
column_6    0.452805
dtype: float64

In [13]:
df1['column_2'].std()

0.13060775042315942

Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the 
mean of column, column_2.

If you are getting errors in executing it then explain why.

[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [14]:
df1['column_2'][2]='column'

In [15]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.945916  0.147849  0.827100  0.989795  0.306548  0.516464
2  0.132754    column  0.612191  0.716993  0.784992  0.229394
3  0.265798  0.336899  0.898173  0.775464  0.609711  0.072037
4  0.032749  0.362606  0.200667  0.331942  0.668250  0.125248
5  0.450534  0.505613  0.422768  0.556811  0.087988  0.901227
6  0.567016  0.194573  0.751008  0.952512  0.979954  0.872463

In [16]:
df1.loc[[2],'column_2']='singh'

In [17]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.945916  0.147849  0.827100  0.989795  0.306548  0.516464
2  0.132754     singh  0.612191  0.716993  0.784992  0.229394
3  0.265798  0.336899  0.898173  0.775464  0.609711  0.072037
4  0.032749  0.362606  0.200667  0.331942  0.668250  0.125248
5  0.450534  0.505613  0.422768  0.556811  0.087988  0.901227
6  0.567016  0.194573  0.751008  0.952512  0.979954  0.872463

IT IS SHOWING ERROR WHEN WE FIND MEAN OF COLUMN_2 BEACAUSE THIS COLUMN CONTAIN
STRING VALUE WITH FLOAT VALUES AND WE KNOW THAT WE CANT FIND MEAN OF STRING VALUE.

Q6. What do you understand about the windows function in pandas and list the types of windows 
functions?

Q7. Write a code to print only the current month and year at the time of answering this question.

In [18]:
import pandas as pd
a=pd.date_range(start='2023-03-18',end='2023-03-18')

In [19]:
b=pd.DataFrame({'date':a})

In [20]:
b['year']=b['date'].dt.year
b['months']=b['date'].dt.month

In [21]:
b

        date  year  months
0 2023-03-18  2023       3

Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and 
calculates the difference between them in days, hours, and minutes using Pandas time delta. The 
program should prompt the user to enter the dates and display the result

In [22]:
a=input('')
b=input('')

 2023-01-25
 2023-01-28

In [23]:
c=a.split('-')
d=b.split('-')

import pandas as pd

In [24]:
years=int(d[0])-int(c[0])
months=int(d[1])-int(c[1])
dayss=int(d[2])-int(c[2])

In [25]:
b=pd.Timedelta(days=dayss)
b

Timedelta('3 days 00:00:00')

Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified 
column to a categorical data type. The program should prompt the user to enter the file path, column 
name, and category order, and then display the sorted data.